src/cf/Documents/CRM_Заявка.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Document>
		<Properties>
			<Name>CRM_Заявка</Name>
			<Posting>Deny</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Наименование</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Телефон</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭлектроннаяПочта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПервичногоИнтереса</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПервичногоИнтереса</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПолучения</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ИсточникиПолученияЛидов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_СкрытьВАРМ</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контакт</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.КонтактВзаимодействия</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИДСобытия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Тема</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>UTMМетка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

src/cf/Catalogs/CRM_ИсточникиПолученияЛидов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>CRM_ИсточникиПолученияЛидов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ИдентификаторИсточника</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КаналПервичногоИнтереса</Name>
					<Type>
						<v8:Type>cfg:ChartOfCharacteristicTypesRef.КаналыРекламныхВоздействий</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникПервичногоИнтереса</Name>
					<Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОтветственныйМенеджер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НаименованиеОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТелефонОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПочтаОбязательно</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Обязательно</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/Catalogs/МаркетинговыеМероприятия.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.10">
	<Catalog>
		<Properties>
			<Name>МаркетинговыеМероприятия</Name>
			<Comment>Произвольные комментарии к мероприятию</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачала</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СегментНоменклатуры</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СегментыНоменклатуры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Завершено</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Аудитория</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Важность</Name>
					<Comment>Важность</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.ВариантыВажностиВзаимодействия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Валюта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ВидКампании</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.CRM_ВидыМаркетинговыхКампаний</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ДатаАктуальности</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Кратность</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Курс</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>4</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_НаправлениеДеятельности</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НаправленияДеятельности</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ПериодАктуальности</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>4</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ПланируемоеКоличествоИнтересов</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ПлановаяСуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ПлановаяСуммаПродаж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СтруктураПредприятия</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_Регион</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.БизнесРегионы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_ФактическаяСуммаЗатрат</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>CRM_UTMМетка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПартнерыИКонтактныеЛица</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Партнер</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КонтактныеЛицаПартнеров</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТекстоваяСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>CRM_СвоиУчастники</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Участник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаНачала</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОкончания</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/WebServices/CRM_LeadsExchange/Ext/Module.bsl
//http://localhost/WSTest/ws/LeadsExchange.1cws?wsdl


Функция GetLeadStructure(ServiceID, SourceID)
	Источник = Справочники.CRM_ИсточникиПолученияЛидов.НайтиПоРеквизиту("ИдентификаторИсточника", SourceID); 
	Если Источник.Пустая() Тогда
		Возврат "Настройки источника не найдены";
	КонецЕсли;

	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_ИсточникиПолученияЛидовДополнительныеРеквизиты.Свойство.Наименование КАК Наименование,
	|	CRM_ИсточникиПолученияЛидовДополнительныеРеквизиты.Свойство,
	|	CRM_ИсточникиПолученияЛидовДополнительныеРеквизиты.Обязательно
	|ИЗ
	|	Справочник.CRM_ИсточникиПолученияЛидов.ДополнительныеРеквизиты КАК CRM_ИсточникиПолученияЛидовДополнительныеРеквизиты
	|ГДЕ
	|	CRM_ИсточникиПолученияЛидовДополнительныеРеквизиты.Ссылка.ИдентификаторИсточника = &ИДИсточника";
	Запрос.УстановитьПараметр("ИДИсточника", SourceID);
	ТаблицаРеквизитов = Запрос.Выполнить().Выгрузить();
     
	ТекстВыгрузки = Новый ЗаписьXML;
	ТекстВыгрузки.УстановитьСтроку();
	ТекстВыгрузки.ЗаписатьНачалоЭлемента("LeadStructure");
	ТекстВыгрузки.ЗаписатьНачалоЭлемента("Fields");
	ТекстВыгрузки.ЗаписатьНачалоЭлемента("Field");
	ТекстВыгрузки.ЗаписатьАтрибут("Name", "ID события");
	ТекстВыгрузки.ЗаписатьАтрибут("ID", "IDСобытия");           
	ТекстВыгрузки.ЗаписатьАтрибут("Type", "String");
	ТекстВыгрузки.ЗаписатьАтрибут("Required", XMLСтрока(Ложь));
	ТекстВыгрузки.ЗаписатьКонецЭлемента();
	ТекстВыгрузки.ЗаписатьНачалоЭлемента("Field");
	ТекстВыгрузки.ЗаписатьАтрибут("Name", "Тема");
	ТекстВыгрузки.ЗаписатьАтрибут("ID", "Тема");           
	ТекстВыгрузки.ЗаписатьАтрибут("Type", "String");
	ТекстВыгрузки.ЗаписатьАтрибут("Required", XMLСтрока(Ложь));
	ТекстВыгрузки.ЗаписатьКонецЭлемента();
	ТекстВыгрузки.ЗаписатьНачалоЭлемента("Field");
	ТекстВыгрузки.ЗаписатьАтрибут("Name", "Контакт");
	ТекстВыгрузки.ЗаписатьАтрибут("ID", "Контакт");           
	ТекстВыгрузки.ЗаписатьАтрибут("Type", "String");
	ТекстВыгрузки.ЗаписатьАтрибут("Required", XMLСтрока(Источник.НаименованиеОбязательно));
	ТекстВыгрузки.ЗаписатьКонецЭлемента();
	ТекстВыгрузки.ЗаписатьНачалоЭлемента("Field");
	ТекстВыгрузки.ЗаписатьАтрибут("Name", "Организация");
	ТекстВыгрузки.ЗаписатьАтрибут("ID", "Организация");           
	ТекстВыгрузки.ЗаписатьАтрибут("Type", "String");
	ТекстВыгрузки.ЗаписатьАтрибут("Required", XMLСтрока(Источник.НаименованиеОбязательно));
	ТекстВыгрузки.ЗаписатьКонецЭлемента();
	ТекстВыгрузки.ЗаписатьНачалоЭлемента("Field");
	ТекстВыгрузки.ЗаписатьАтрибут("Name", "Телефон");
	ТекстВыгрузки.ЗаписатьАтрибут("ID", "Телефон");           
	ТекстВыгрузки.ЗаписатьАтрибут("Type", "String");
	ТекстВыгрузки.ЗаписатьАтрибут("Required", XMLСтрока(Источник.ТелефонОбязательно));
	ТекстВыгрузки.ЗаписатьКонецЭлемента();
	ТекстВыгрузки.ЗаписатьНачалоЭлемента("Field");
	ТекстВыгрузки.ЗаписатьАтрибут("Name", "Электронная почта");
	ТекстВыгрузки.ЗаписатьАтрибут("ID", "ЭлектроннаяПочта");           
	ТекстВыгрузки.ЗаписатьАтрибут("Type", "String");
	ТекстВыгрузки.ЗаписатьАтрибут("Required", XMLСтрока(Источник.ПочтаОбязательно));
	ТекстВыгрузки.ЗаписатьКонецЭлемента();
	ТекстВыгрузки.ЗаписатьНачалоЭлемента("Field");
	ТекстВыгрузки.ЗаписатьАтрибут("Name", "UTM метка");
	ТекстВыгрузки.ЗаписатьАтрибут("ID", "UTMМетка");           
	ТекстВыгрузки.ЗаписатьАтрибут("Type", "String");
	ТекстВыгрузки.ЗаписатьАтрибут("Required", XMLСтрока(Ложь));
	ТекстВыгрузки.ЗаписатьКонецЭлемента();
	Для Каждого Строка Из ТаблицаРеквизитов Цикл
		ТекстВыгрузки.ЗаписатьНачалоЭлемента("Field");
		ТекстВыгрузки.ЗаписатьАтрибут("Name", XMLСтрока(Строка.Свойство.Заголовок));
		ТекстВыгрузки.ЗаписатьАтрибут("ID", XMLСтрока(Строка.Свойство.УникальныйИдентификатор()));           
		Если Строка.Свойство.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
			ТекстВыгрузки.ЗаписатьАтрибут("Type", "String");
		ИначеЕсли Строка.Свойство.ТипЗначения.СодержитТип(Тип("Число")) Тогда
			ТекстВыгрузки.ЗаписатьАтрибут("Type", "Integer");
		ИначеЕсли Строка.Свойство.ТипЗначения.СодержитТип(Тип("Дата")) Тогда
			ТекстВыгрузки.ЗаписатьАтрибут("Type", "Date");	
		ИначеЕсли Строка.Свойство.ТипЗначения.СодержитТип(Тип("Булево")) Тогда	
			ТекстВыгрузки.ЗаписатьАтрибут("Type", "Boolean");	
		КонецЕсли;	
		ТекстВыгрузки.ЗаписатьАтрибут("Required", XMLСтрока(Строка.Обязательно));
		ТекстВыгрузки.ЗаписатьКонецЭлемента();
	КонецЦикла;	
	ТекстВыгрузки.ЗаписатьКонецЭлемента();
	ТекстВыгрузки.ЗаписатьКонецЭлемента();
	СтрокаВозврата = ТекстВыгрузки.Закрыть();
	Возврат СтрокаВозврата;
КонецФункции

Функция LoadLead(ServiceID, SourceID, LeadStructure)
	Источник = Справочники.CRM_ИсточникиПолученияЛидов.НайтиПоРеквизиту("ИдентификаторИсточника", SourceID); 
	Если Источник.Пустая() Тогда
		Возврат "Настройки источника не найдены";
	КонецЕсли;
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	|	CRM_ИсточникиПолученияЛидовДополнительныеРеквизиты.Свойство.Наименование КАК Наименование,
	|	CRM_ИсточникиПолученияЛидовДополнительныеРеквизиты.Свойство
	|ИЗ
	|	Справочник.CRM_ИсточникиПолученияЛидов.ДополнительныеРеквизиты КАК CRM_ИсточникиПолученияЛидовДополнительныеРеквизиты
	|ГДЕ
	|	CRM_ИсточникиПолученияЛидовДополнительныеРеквизиты.Ссылка.ИдентификаторИсточника = &ИДИсточника";
	Запрос.УстановитьПараметр("ИДИсточника", SourceID);
	ТаблицаРеквизитов = Запрос.Выполнить().Выгрузить();
	
	ЧтениеXML = Новый ЧтениеXML;
	ЧтениеXML.УстановитьСтроку(LeadStructure);
	ПостроительDOM = Новый ПостроительDOM; 
	ДокументDOM = ПостроительDOM.Прочитать(ЧтениеXML);
	КорневойУзел = ДокументDOM.ПервыйДочерний;
	ИДСервиса = "";
	ИДИсточника = "";
	Заявка = Документы.CRM_Заявка.СоздатьДокумент();
	Заявка.Дата = CRM_ОбщегоНазначенияСервер.ПолучитьТекущуюДатуСеанса();
	Заявка.ИсточникПолучения = Источник;
	Заявка.Ответственный = Источник.ОтветственныйМенеджер;
	Заявка.КаналПервичногоИнтереса = Источник.КаналПервичногоИнтереса;
	Заявка.ИсточникПервичногоИнтереса = Источник.ИсточникПервичногоИнтереса;
	Для Каждого ДанныеВыгрузки из КорневойУзел.ДочерниеУзлы Цикл
		Если ДанныеВыгрузки.ИмяУзла = "Fields" Тогда
			Для Каждого Поле из ДанныеВыгрузки.ДочерниеУзлы Цикл
				Если Поле.ИмяУзла = "Field" Тогда
					ИмяРеквизита = "";
					ЗначениеРеквизита = "";
					Для Каждого Атрибут из Поле.Атрибуты Цикл
						Если Атрибут.ИмяУзла = "ID" Тогда
							ИмяРеквизита = Атрибут.ЗначениеУзла;
						ИначеЕсли Атрибут.ИмяУзла = "Type" Тогда	
							ЗначениеРеквизита = Атрибут.ЗначениеУзла;
						КонецЕсли;	
					КонецЦикла;
					Если ИмяРеквизита = "Наименование" Тогда
						Заявка.Наименование = ЗначениеРеквизита;
					ИначеЕсли ИмяРеквизита = "Телефон" Тогда
						Заявка.Телефон = ЗначениеРеквизита;	
					ИначеЕсли ИмяРеквизита = "ЭлектроннаяПочта" Тогда
						Заявка.ЭлектроннаяПочта = ЗначениеРеквизита;
					ИначеЕсли ИмяРеквизита = "IDСобытия" Тогда
						Заявка.ИДСобытия = ЗначениеРеквизита;	
					ИначеЕсли ИмяРеквизита = "UTMМетка" Тогда
						Заявка.UTMМетка = СокрЛП(ЗначениеРеквизита);	
					Иначе	
						Попытка
							ИДРеквизита = Новый УникальныйИдентификатор(ИмяРеквизита);
							Реквизит = ПланыВидовХарактеристик.ДополнительныеРеквизитыИСведения.ПолучитьСсылку(ИДРеквизита);
							Строка = Заявка.ДополнительныеРеквизиты.Добавить();
							Строка.Свойство = Реквизит;
							Если Строка.Свойство.ТипЗначения.СодержитТип(Тип("Строка")) Тогда
								Строка.Значение = XMLЗначение(Тип("Строка"), ЗначениеРеквизита);
							ИначеЕсли Строка.Свойство.ТипЗначения.СодержитТип(Тип("Число")) Тогда
								Строка.Значение = XMLЗначение(Тип("Число"), ЗначениеРеквизита);
							ИначеЕсли Строка.Свойство.ТипЗначения.СодержитТип(Тип("Дата")) Тогда
								Строка.Значение = XMLЗначение(Тип("Дата"), ЗначениеРеквизита);
							ИначеЕсли Строка.Свойство.ТипЗначения.СодержитТип(Тип("Булево")) Тогда	
								Строка.Значение = XMLЗначение(Тип("Булево"), ЗначениеРеквизита);
							КонецЕсли;
						Исключение
						КонецПопытки;
					КонецЕсли;
				КонецЕсли;	
				
			КонецЦикла;	
		
		КонецЕсли;	
	КонецЦикла;
	Если Заявка.ИДСобытия <> "" Тогда
		НайденнаяЗаявка = Документы.CRM_Заявка.НайтиПоРеквизиту("ИДСобытия", Заявка.ИДСобытия);
		Если НЕ НайденнаяЗаявка.Пустая() Тогда
			Заявка = Неопределено;
			Возврат Строка(НайденнаяЗаявка.УникальныйИдентификатор());
		КонецЕсли;
	КонецЕсли;	
	Если ЗначениеЗаполнено(Заявка.UTMМетка) Тогда
		Если Заявка.КаналПервичногоИнтереса.ТипЗначения.СодержитТип(Тип("СправочникСсылка.МаркетинговыеМероприятия")) Тогда
			Заявка.ИсточникПервичногоИнтереса = Справочники.МаркетинговыеМероприятия.НайтиПоРеквизиту("CRM_UTMМетка", Заявка.UTMМетка);
		КонецЕсли;	
	КонецЕсли;	
	Заявка.Записать();
	РегистрыСведений.CRM_СостоянияЛидов.ЗаписатьСостояниеЛида(Заявка.Ссылка);
	Возврат Строка(Заявка.Ссылка.УникальныйИдентификатор());
КонецФункции
